
Функция getUserGET(Запрос)
	ЗапросПользователи = Новый Запрос; 
ЗапросПользователи.Текст = "ВЫБРАТЬ
               |    УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
               |    Пользователи.Наименование КАК Наименование,
               |    Пользователи.Код КАК Код
               |ИЗ
               |    Справочник.Пользователи КАК Пользователи
               |ГДЕ
               |    НЕ Пользователи.ПометкаУдаления
               |
               |УПОРЯДОЧИТЬ ПО
               |    Наименование";

РезультатЗапроса = ЗапросПользователи.Выполнить();

МассивПользователей= Новый Массив; //1

Выборка = РезультатЗапроса.Выбрать();
Пока Выборка.Следующий() Цикл

    ДанныеПользователя = Новый Структура; //2
    ДанныеПользователя.Вставить("guid", Строка(Выборка.Ссылка));
    ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
    ДанныеПользователя.Вставить("code", Строка(Выборка.Код));

    МассивПользователей.Добавить(ДанныеПользователя); //3

КонецЦикла;

Ответ = Новый HTTPСервисОтвет(200); //4

ЗаписьJSON = Новый ЗаписьJSON; //5
ЗаписьJSON.УстановитьСтроку();
ЗаписатьJSON(ЗаписьJSON, МассивПользователей);
СтрокаОтвета = ЗаписьJSON.Закрыть();

Ответ.УстановитьТелоИзСтроки(СтрокаОтвета); //6

Возврат Ответ; //7КонецФункции
КонецФункции
