
Процедура ОплатаПоставщикуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		
	Для каждого ФормируемаяЗадачи Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадачи.Наименование  = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + " (Закупка товара: " + Номенклатура.Наименование +")";
	КонецЦикла;
		
КонецПроцедуры


Процедура ПриемТовараПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для каждого ФормируемаяЗадачи Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадачи.Наименование  = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + " (Закупка товара: " + Номенклатура.Наименование +")";
	КонецЦикла;

	
КонецПроцедуры


Процедура ОплатаПоставщикуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)

	БизнесПроцесс = Задача.БизнесПроцесс;
	
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ЗакупкаУПоставщика.ТочкиМаршрута.ОплатаПоставщику Тогда
		Отказ = НЕ ЗначениеЗаполнено(Задача.ОплатаПоставщику);
		Если Отказ = Истина Тогда
			Сообщить("Создайте документ ""Расход денежных средств"" и укажите его в задаче! ");
		Иначе
			БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
			БизнесПроцессОбъект.ОплатаПоставщику = Задача.ОплатаПоставщику;
			БизнесПроцессОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры


Процедура ПоставщикПотвердилПоставкуПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ПоставкаПодтверждена;
	
КонецПроцедуры

