
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.УчетнаяПолитика = УчетнаяПолитика;
	
	Если УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.ПоСредней Тогда //1*
		
		Движения.ТоварыНаСкладах.Записывать = Истина; //2
		
		Блокировка = Новый БлокировкаДанных; //3
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос; //4
		Запрос.Текст =
		"ВЫБРАТЬ
		|    ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|    ТоварыНаСкладахОстатки.Склад КАК Склад,
		|    ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		|    ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
		|    ТоварыНаСкладахОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|    РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментИтогов, ) КАК ТоварыНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("МоментИтогов", Новый Граница(МоментВремени())); //5
		
		Выборка = Запрос.Выполнить().Выбрать(); //6
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ТоварыНаСкладах.ДобавитьРасход(); //7
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			
			Движение = Движения.ТоварыНаСкладах.ДобавитьПриход(); //8
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка,,"СрокГодности");
			
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры



