 &НаКлиенте
Процедура ПризнакБесрочногоДоговораПриИзменении(Элемент)
	УстановитьВидимость()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Если НЕ ЗначениеЗаполнено (Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли;
КонецПроцедуры

 &НаКлиенте
 Процедура УстановитьВидимость()  
	 
	Если Объект.ПризнакБессрочногоДоговора Тогда 

    Элементы.ДатаОкончанияДоговора.Видимость = Ложь;

    Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) Тогда 
        Объект.ДатаОкончанияДоговора = '0001,01,01';
    КонецЕсли;

Иначе

    Элементы.ДатаОкончанияДоговора.Видимость = Истина;

КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	Если ЗначениеЗаполнено(Объект.ВнешнийНомерДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.ВнешнийНомерДоговора + " от " + Объект.ДатаЗаключенияДоговора;
	ИначеЕсли ЗначениеЗаполнено(Объект.ВнешнийНомерДоговора)
		И НЕ ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.ВнешнийНомерДоговора;
	Иначе
		Объект.Наименование = "№ " + Объект.ДатаЗаключенияДоговора;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВнешнийНомерДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора()
КонецПроцедуры


&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора()
КонецПроцедуры

