
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте

Процедура УстановитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипКонтрагента.Клиент") Тогда
		Элементы.ДатаРождения.Видимость = Истина;
		Элементы.ПолКлиента.Видимость = Истина;
		Элементы.ИсточникиПолученияИнформацииОКомпании.Видимость = Истина;
		Элементы.ОсновнойДоговор.Видимость = Ложь;
	Иначе
		Элементы.ДатаРождения.Видимость = Ложь;
		Элементы.ПолКлиента.Видимость = Ложь;
		Элементы.ИсточникиПолученияИнформацииОКомпании.Видимость = Ложь;
		Элементы.ОсновнойДоговор.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость()
КонецПроцедуры



		