
&НаКлиенте
Процедура Получитьноменклатуру(Команда)
	ПолучитьНоменклатуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьНоменклатуруНаСервере()

Прокси = WSСсылки.ДанныеНоменклатуры.СоздатьWSПрокси("http://practicum.yandex.ru", "goods", "goodsSoap"); //1
Прокси.Пользователь = "Администратор"; //2

СписокНоменклатуры = Прокси.get(); //3

Если СписокНоменклатуры = Неопределено Тогда
    Возврат;
КонецЕсли;

Для Каждого Номенклатура Из СписокНоменклатуры.Номенклатура Цикл //4
    Сообщить(Номенклатура.Наименование);
КонецЦикла;

КонецПроцедуры 