
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаЗагрузкиНовостей = ТекущаяДата();
	КоличествоНовостей = 5;
	СтрокаПоиска = "Business";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНовости(Команда) 
	
	ЗагрузитьНовостиНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНовостиНаСервере()
	
	ТопНовости = "";
	
	Сервер = "newsapi.org"; 
	АдресЗапроса = "/v2/everything";
	ПараметрыЗапроса = СтрШаблон("apiKey=%1&sortBy=popularity&from=%2&q=%3", СокрЛП(Константы.API_KEY_newsapi.Получить()),
	Формат(ДатаЗагрузкиНовостей, "ДФ=yyyy-dd-MM"), СокрЛП(СтрокаПоиска)); //1
	
	АдресЗапроса = АдресЗапроса + "?" + ПараметрыЗапроса; //2
	
	ВозвращаемоеЗначение = РаботаСHTTP.ПолучитьДанныеИзСервиса(Сервер, АдресЗапроса); //3
	
	Если ВозвращаемоеЗначение.УспешныйЗапрос = Ложь Тогда //4
		Сообщить(ВозвращаемоеЗначение.ТекстОшибки);
		возврат;
	ИначеЕсли ВозвращаемоеЗначение.HTTPОтвет.КодСостояния <> 200 Тогда
		Сообщить(СтрШаблон("Код вернул код состояния, отличный от 200: %1", ВозвращаемоеЗначение.HTTPОтвет.КодСостояния));
		возврат;
	КонецЕсли;
	
	СтрокаJSON = ВозвращаемоеЗначение.HTTPОтвет.ПолучитьТелоКакСтроку(); //5
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Новости = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	Итератор = 1;
	
	Если Новости <> Неопределено Тогда //6
		Для Каждого Статья Из Новости.articles Цикл
			ТопНовости = ТопНовости + Строка(Итератор) + ") " + "Источник: " + Статья.url + Символы.ПС + Статья.title + Символы.ПС;
			ТопНовости = ТопНовости + Статья.description + Символы.ПС + Символы.ПС;
			Если Итератор = КоличествоНовостей Тогда
				прервать;
			КонецЕсли;
			Итератор = Итератор + 1;
		КонецЦикла;
	Конецесли;
	
КонецПроцедуры 
