
Процедура ОбработкаПроведения(Отказ, Режим)	  
	
	СтруктураУчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);
	
	Если СтруктураУчетнаяПолитика.УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.FEFO Тогда
		ОтражатьСрокиГодности = Истина;
	Иначе
		ОтражатьСрокиГодности = Ложь;
				
	КонецЕсли; 	
	
	Движения.ЦеныНоменклатурыПоставщиков.Записывать = Истина;
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровИМатериаловТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровИМатериаловТовары.Цена КАК Цена,
	|	СУММА(ПоступлениеТоваровИМатериаловТовары.Количество) КАК Количество,
	|	СУММА(ПоступлениеТоваровИМатериаловТовары.Сумма) КАК Сумма,
	|	ПоступлениеТоваровИМатериаловТовары.СрокГодности КАК СрокГодности,
	|	ПоступлениеТоваровИМатериаловТовары.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	Документ.ПоступлениеТоваровИМатериалов.Товары КАК ПоступлениеТоваровИМатериаловТовары
	|ГДЕ
	|	ПоступлениеТоваровИМатериаловТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровИМатериаловТовары.Номенклатура,
	|	ПоступлениеТоваровИМатериаловТовары.Цена,
	|	ПоступлениеТоваровИМатериаловТовары.СрокГодности,
	|	ПоступлениеТоваровИМатериаловТовары.Номенклатура.СчетБухгалтерскогоУчета
	|ИТОГИ
	|	МАКСИМУМ(Цена)
	|ПО
	|	Номенклатура";
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл 
		
		Движение = Движения.ЦеныНоменклатурыПоставщиков.Добавить(); 
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаИтоги.Номенклатура;
		Движение.Поставщик = Поставщик;
		Движение.Цена = ВыборкаИтоги.Цена;
		
		Выборка = ВыборкаИтоги.Выбрать(); 
		Пока Выборка.Следующий() Цикл 
			Движение = Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Сумма = Выборка.Сумма;
			Движение.Склад = Склад;
			Движение.Количество = Выборка.Количество;
			Если ОтражатьСрокиГодности  Тогда 
				Движение.СрокГодности = Выборка.СрокГодности;
			КонецЕсли;
			
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.СчетДт = Выборка.СчетБухгалтерскогоУчета;
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
			Движение.Период = Дата;
			Движение.Сумма = Выборка.Сумма;
			Движение.Содержание = "Отражено поступление товарно-материальных ценостей от поставщика";
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = Выборка.Номенклатура;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты] = Поставщик;
			
		КонецЦикла;
	КонецЦикла; 	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(АвторДокумента) Тогда	
		АвторДокумента = ПараметрыСеанса.ТекущийПользователь;  	
	КонецЕсли; 
	СуммаДокумента = Товары.Итог("Сумма"); 
	
  	//СтрокиГодности = Справочники.Номенклатура.НайтиПоНаименованию("").СрокиГодности;
//	Для каждого Строка Из Товары Цикл	
	//	Строка.СрокГодности = ВходящаяДата + Справочники.Номенклатура.НайтиПоНаименованию("").СрокиГодности *24*60*60; 
//	КонецЦикла;
	
    	
КонецПроцедуры

