
&НаКлиенте
Процедура ДатаЗагрузкиПриИзменении(Элемент)
	
	ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере();	
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаЗагрузки = Текущаядата();
	ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере()
	
	Сервер = "cbr.ru"; //1
	АдресЗапроса = "/scripts/XML_daily.asp?date_req=" + Формат(ДатаЗагрузки, "ДФ=dd/MM/yyyy"); //2
	
	ВозвращаемоеЗначение = РаботаСHTTP.ПолучитьДанныеИзСервиса(Сервер, АдресЗапроса); //3
	
	Если ВозвращаемоеЗначение.УспешныйЗапрос = Ложь Тогда //4
		Сообщить(ВозвращаемоеЗначение.ТекстОшибки);
		возврат;
	ИначеЕсли ВозвращаемоеЗначение.HTTPОтвет.КодСостояния <> 200 Тогда //5
		Сообщить(СтрШаблон("Код вернул код состояния, отличный от 200: %1", ВозвращаемоеЗначение.HTTPОтвет.КодСостояния));
		возврат;
	КонецЕсли;
	
	СтрокаXML = ВозвращаемоеЗначение.HTTPОтвет.ПолучитьТелоКакСтроку(); //6
	ПрочитатьИзXMLПоследовательно(СтрокаXML); //7
	
КонецПроцедуры


&НаСервере
Процедура ПрочитатьИзXMLПоследовательно(СтрокаXML)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML); //1
	
	Валюта = Неопределено;
	
	Пока ЧтениеXML.Прочитать() Цикл //2
		
		//ищем ID= R01235 (доллар) R01375 (юань) R01239 (евро)
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			НужнаяВалюта = Ложь;
			
			Пока ЧтениеXML.ПрочитатьАтрибут() Цикл //3
				Если  ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "R01235" Тогда
					Валюта = "USD";
				ИначеЕсли ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "R01239" Тогда
					Валюта = "EURO";
				ИначеЕсли ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "R01375" Тогда
					Валюта = "CNY";
				Иначе
					Валюта = Неопределено;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Валюта <> Неопределено
			И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "VunitRate" Тогда
			ЧтениеXML.Прочитать();
			Если Валюта = "USD" Тогда //4
				КурсДоллараНаСегодня = ЧтениеXML.Значение;
			ИначеЕсли Валюта = "EURO" Тогда
				КурсЕвроНаСегодня = ЧтениеXML.Значение;
			ИначеЕсли Валюта = "CNY" Тогда
				КурсЮаняНаСегодня = ЧтениеXML.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
КонецПроцедуры 